zh_cn/posts/maintain-test-cases-with-org-mode/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Maintain test cases with org-mode | BaoLong</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS (en)" href="../../../rss.xml">
<link rel="alternate" type="application/rss+xml" title="RSS (zh_cn)" href="../../rss.xml">
<link rel="canonical" href="https://baolonglin.github.io/zh_cn/posts/maintain-test-cases-with-org-mode/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Baolong Lin">
<meta property="og:site_name" content="BaoLong">
<meta property="og:title" content="Maintain test cases with org-mode">
<meta property="og:url" content="https://baolonglin.github.io/zh_cn/posts/maintain-test-cases-with-org-mode/">
<meta property="og:description" content="Introduction


Org-mode is known as good tool to do planning/scheduling, but it also used as literate programming tool. It's quite nice to use Babel to execute code inside org-mode, it should be possi">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-12-29T14:26:15+01:00">
<meta property="article:tag" content="org-mode">
<link rel="alternate" hreflang="en" href="../../../posts/maintain-test-cases-with-org-mode/">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://baolonglin.github.io/zh_cn/">

                <span id="blog-title">BaoLong</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">文章存档</a>
                </li>
<li>
<a href="../../categories/">标签</a>
                </li>
<li>
<a href="../../rss.xml">RSS 源</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
            </li>
<li><a href="https://baolonglin.github.io/" rel="alternate" hreflang="en">English</a></li>

                
                    
    <li>
    <a href="index.org" id="sourcelink">源代码</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Maintain test cases with org-mode</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Baolong Lin
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-12-29T14:26:15+01:00" itemprop="datePublished" title="2017-12-29 14:26">2017-12-29 14:26</time></a></p>
                <p class="commentline">
        


            
        </p>
<p class="sourceline"><a href="index.org" class="sourcelink">源代码</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org44634ca" class="outline-2">
<h2 id="org44634ca">Introduction</h2>
<div class="outline-text-2" id="text-org44634ca">
<p>
Org-mode is known as good tool to do planning/scheduling, but it also used as <a href="http://howardism.org/Technical/Emacs/literate-programming-tutorial.html">literate programming tool</a>. It's quite nice to use <a href="http://orgmode.org/worg/org-contrib/babel/">Babel</a> to execute code inside org-mode, it should be possible to use org-mode write test case.
Right now I could not find one native way inside org-mode to support this.
The tool I need to test is quit simple, <a href="https://clang.llvm.org/docs/ClangFormat.html">clang-format</a>, input one code snippet, output formated code.
</p>
</div>
</div>

<div id="outline-container-org66c6375" class="outline-2">
<h2 id="org66c6375">Prequirements</h2>
<div class="outline-text-2" id="text-org66c6375">
<p>
Here list my environment:
</p>
<ul class="org-ul">
<li>Emacs 26</li>
<li>Org-mode 9.1.4</li>
<li>Babel load language elisp, bash</li>
</ul>
</div>
</div>

<div id="outline-container-org83abc5b" class="outline-2">
<h2 id="org83abc5b">Setup</h2>
<div class="outline-text-2" id="text-org83abc5b">
<p>
Just create one org file, input content like:
</p>
<div class="highlight"><pre><span></span>* Test title
** Setup
#+BEGIN_SRC elisp
(setq org-confirm-babel-evaluate nil)
#+END_SRC
** Test suite title
*** Test case title
    &lt;&lt; add test case content here, use yasnippet to insert here &gt;&gt;
** Report
#+BEGIN_SRC emacs-lisp
  (org-element-map (org-element-parse-buffer) '(fixed-width example-block)
    (lambda (result)
      (progn
	(list (org-element-property :results result)
	      (if (string-prefix-p "PASS" (org-element-property :value result) )
		  "PASS"
		"FAILED")
	      )
	))
    )
#+END_SRC
</pre></div>

<p>
The content under Setup headline describes the setup information.
The content under Report headline describes the test result report.
The test case use yasnippet like:
</p>
<div class="highlight"><pre><span></span># -*- mode: snippet -*-
# name: tftc
# key: tftc
# --
*** ${1: test case name}
#+name: ${1:$(replace-regexp-in-string " " "-" (downcase yas-text))}
#+BEGIN_SRC bash :results verbatim
format_result="$(clang-format &lt;&lt; EOF
{
${2: input original source code}
}
EOF
)"

require_format="$(cat &lt;&lt; EOF
{
${3: input expected source code}
}
EOF
)"

diff -u &lt;(echo "$format_result") &lt;(echo "$require_format")
if [ "$?" -eq 0 ]; then
echo "PASS"
else
echo "FAILED"
fi
#+END_SRC
</pre></div>

<p>
After added the test case just execute org-babel-execute-buffer, the test report will be generated in the end of current org file.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/org-mode/" rel="tag">org-mode</a></li>
        </ul></nav></aside><section class="comments hidden-print"><h2>注释</h2>
        
        


        </section></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:lbl52001@gmail.com">Baolong Lin</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script src="../../../assets/js/colorbox-i18n/jquery.colorbox-zh-CN.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("zh-cn");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
